WITH a_tb AS (
SELECT
	"销售处理表".*,
	"老架构"."总部",
	"老架构"."事业部名称",
	"老架构"."事业组名称" 
FROM
	"销售处理表"
	LEFT JOIN "老架构" ON "销售处理表"."MD号码" = "老架构"."MD编号")
	
	
SELECT
	a_tb."年月",
	a_tb."公司",
	a_tb."渠道1",
	a_tb."总部",
	a_tb."事业部名称",
	a_tb."事业组名称",
	a_tb."MD号码",
	a_tb."MD名",
	a_tb."商品区分",
	a_tb."大分类名",
	a_tb."中分类名称",
	"每月商品按分类仓库信息表"."小分类",
	"每月商品按分类仓库信息表"."细分类",
	a_tb."商品编号",
	a_tb."商品名称",
	a_tb."品牌编号",
	a_tb."品牌名称",
	a_tb."供应商编号",
	a_tb."供应商名称",
	a_tb."订购数量",
	a_tb."订购金额",
	a_tb."取消数量",
	a_tb."取消金额",
	a_tb."净订购数量",
	a_tb."净订购金额",
	a_tb."出库数量",
	a_tb."出库金额",
	a_tb."配送完成数量",
	a_tb."配送完成金额",
	a_tb."退货数量",
	a_tb."退货金额",
	a_tb."销售数量",
	a_tb."销售金额",
	a_tb."销售利润",
	concat ( ROUND(a_tb."毛利率（%）" * 100 ), '%' ) AS 毛利率,
	a_tb."交换数量",
	a_tb."交换金额",
	a_tb."回收数量",
	a_tb."回收金额",
	a_tb."拒收数量",
	a_tb."拒收金额",
	a_tb."渠道2",
	a_tb."主供应商",
	a_tb."是否TVP",
	"每月商品按分类仓库信息表"."是否提货券",
	"每月商品按分类仓库信息表"."是否供应商兑换券",
	"每月商品按分类仓库信息表"."商品仓库" AS 配送方式	
FROM
	a_tb
	LEFT JOIN "每月商品按分类仓库信息表" ON a_tb."商品编号" = "每月商品按分类仓库信息表"."货号";
